app/Controllers/ProdukController.php

    public function create()
{
    $data = [
        'kode_produk' => $this->request->getVar('kode_produk'),
        'nama_produk' => $this->request->getVar('nama_produk'),
        'harga' => $this->request->getVar('harga')
    ];

    $model = new MProduk();
    $model->insert($data);
    $produk = $model->find($model->getInsertID());
---
INSERT INTO `produk` (`kode_produk`, `nama_produk`, `harga`) VALUES ('A001', 'Smasung TV 24inch', 70000)
SELECT *
FROM `produk`
WHERE `produk`.`id` = 3